# 十分钟熟悉pandas

In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])
#创建一个series
# np.nan Nah空值

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

## 利用数组，创建一个DataFrame

In [6]:
dates = pd.date_range('20181002', periods=6)
#产生时间序列data_range.

In [7]:
dates

DatetimeIndex(['2018-10-02', '2018-10-03', '2018-10-04', '2018-10-05',
               '2018-10-06', '2018-10-07'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))

In [9]:
df

                   A         B         C         D
2018-10-02  0.770187 -0.746192 -1.660992 -0.748080
2018-10-03  1.301462  1.842697  1.244710 -0.494499
2018-10-04 -0.824994  0.099508  1.121323  0.326114
2018-10-05 -0.523437  0.476425  0.388166 -0.022367
2018-10-06 -0.279958  1.293217  1.554930  1.827205
2018-10-07  0.878926  0.772512 -1.137611 -0.421024

## 通过字典(dict)传入的对象而创建的DataFrame可以转为series样式

In [10]:
df2 = pd.DataFrame({'A':1,
                                   'B':pd.Timestamp('20181002'),
                                   'C':pd.Series(1, index = list(range(4)), dtype='float32'),
                                   'D':np.array([3]*4, dtype = 'int32'),
                                   'E':pd.Categorical(["test", "train", "test", "train"]),
                                   'F':'foo'})

In [11]:
df2.A

0    1
1    1
2    1
3    1
Name: A, dtype: int64

In [12]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head(2)
# 顶部行的数据

                   A         B         C         D
2018-10-02  0.770187 -0.746192 -1.660992 -0.748080
2018-10-03  1.301462  1.842697  1.244710 -0.494499

In [14]:
df.tail(3)
# 尾部行的数据

                   A         B         C         D
2018-10-05 -0.523437  0.476425  0.388166 -0.022367
2018-10-06 -0.279958  1.293217  1.554930  1.827205
2018-10-07  0.878926  0.772512 -1.137611 -0.421024

In [15]:
df.index

DatetimeIndex(['2018-10-02', '2018-10-03', '2018-10-04', '2018-10-05',
               '2018-10-06', '2018-10-07'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[ 0.77018698, -0.7461917 , -1.66099249, -0.74807954],
       [ 1.3014622 ,  1.84269712,  1.24471028, -0.4944989 ],
       [-0.82499371,  0.09950784,  1.12132289,  0.3261136 ],
       [-0.52343735,  0.47642535,  0.38816553, -0.02236693],
       [-0.27995826,  1.29321681,  1.55492992,  1.82720475],
       [ 0.87892567,  0.77251185, -1.13761087, -0.42102448]])

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.220364  0.623028  0.251754  0.077891
std    0.871908  0.908782  1.345208  0.937074
min   -0.824994 -0.746192 -1.660992 -0.748080
25%   -0.462568  0.193737 -0.756167 -0.476130
50%    0.245114  0.624469  0.754744 -0.221696
75%    0.851741  1.163041  1.213863  0.238993
max    1.301462  1.842697  1.554930  1.827205

In [19]:
df.T

   2018-10-02  2018-10-03  2018-10-04  2018-10-05  2018-10-06  2018-10-07
A    0.770187    1.301462   -0.824994   -0.523437   -0.279958    0.878926
B   -0.746192    1.842697    0.099508    0.476425    1.293217    0.772512
C   -1.660992    1.244710    1.121323    0.388166    1.554930   -1.137611
D   -0.748080   -0.494499    0.326114   -0.022367    1.827205   -0.421024

In [20]:
df

                   A         B         C         D
2018-10-02  0.770187 -0.746192 -1.660992 -0.748080
2018-10-03  1.301462  1.842697  1.244710 -0.494499
2018-10-04 -0.824994  0.099508  1.121323  0.326114
2018-10-05 -0.523437  0.476425  0.388166 -0.022367
2018-10-06 -0.279958  1.293217  1.554930  1.827205
2018-10-07  0.878926  0.772512 -1.137611 -0.421024

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-10-02  0.535627  0.168697 -1.567862  1.064473
2018-10-03  1.885957  0.356511 -0.718623  0.299244
2018-10-04  0.068331  0.350937  0.415351 -0.109833
2018-10-05  0.387755 -1.020656  0.441762 -1.869260
2018-10-06  0.838419  0.289968  0.122176 -0.725324
2018-10-07  1.700180  1.162312  0.968887 -0.469505

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2018-10-02  1.064473 -1.567862  0.168697  0.535627
2018-10-03  0.299244 -0.718623  0.356511  1.885957
2018-10-06 -0.725324  0.122176  0.289968  0.838419
2018-10-04 -0.109833  0.415351  0.350937  0.068331
2018-10-05 -1.869260  0.441762 -1.020656  0.387755
2018-10-07 -0.469505  0.968887  1.162312  1.700180

In [21]:
df['A']

2018-10-02    1.064473
2018-10-03    0.299244
2018-10-04   -0.109833
2018-10-05   -1.869260
2018-10-06   -0.725324
2018-10-07   -0.469505
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2018-10-02  1.064473 -1.567862  0.168697  0.535627
2018-10-03  0.299244 -0.718623  0.356511  1.885957
2018-10-04 -0.109833  0.415351  0.350937  0.068331

In [29]:
df.loc['20181002':'20181004']

                   A         B         C         D
2018-10-02  1.064473 -1.567862  0.168697  0.535627
2018-10-03  0.299244 -0.718623  0.356511  1.885957
2018-10-04 -0.109833  0.415351  0.350937  0.068331

In [30]:
df.loc['20181002']

A    1.064473
B   -1.567862
C    0.168697
D    0.535627
Name: 2018-10-02 00:00:00, dtype: float64

In [31]:
df.loc[:, ['A', 'B']]

                   A         B
2018-10-02  1.064473 -1.567862
2018-10-03  0.299244 -0.718623
2018-10-04 -0.109833  0.415351
2018-10-05 -1.869260  0.441762
2018-10-06 -0.725324  0.122176
2018-10-07 -0.469505  0.968887

In [36]:
df.loc['20181002', ['A', 'B']]

A    1.064473
B   -1.567862
Name: 2018-10-02 00:00:00, dtype: float64

In [37]:
df.loc['20181002', 'A']

1.0644734663596784

In [38]:
df.iloc[3]

A   -1.869260
B    0.441762
C   -1.020656
D    0.387755
Name: 2018-10-05 00:00:00, dtype: float64

In [41]:
df.iloc[0:3, 0:2]

                   A         B
2018-10-02  1.064473 -1.567862
2018-10-03  0.299244 -0.718623
2018-10-04 -0.109833  0.415351

In [42]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2018-10-03  0.299244  0.356511
2018-10-04 -0.109833  0.350937
2018-10-06 -0.725324  0.289968

In [43]:
df.iloc[1:3,:]

                   A         B         C         D
2018-10-03  0.299244 -0.718623  0.356511  1.885957
2018-10-04 -0.109833  0.415351  0.350937  0.068331

In [44]:
df.iloc[1,1]

-0.7186229752290938

In [45]:
df[df.A>0]

                   A         B         C         D
2018-10-02  1.064473 -1.567862  0.168697  0.535627
2018-10-03  0.299244 -0.718623  0.356511  1.885957

In [46]:
df[df>0]

                   A         B         C         D
2018-10-02  1.064473       NaN  0.168697  0.535627
2018-10-03  0.299244       NaN  0.356511  1.885957
2018-10-04       NaN  0.415351  0.350937  0.068331
2018-10-05       NaN  0.441762       NaN  0.387755
2018-10-06       NaN  0.122176  0.289968  0.838419
2018-10-07       NaN  0.968887  1.162312  1.700180

In [47]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [48]:
df2

                   A         B         C         D      E
2018-10-02  1.064473 -1.567862  0.168697  0.535627    one
2018-10-03  0.299244 -0.718623  0.356511  1.885957    one
2018-10-04 -0.109833  0.415351  0.350937  0.068331    two
2018-10-05 -1.869260  0.441762 -1.020656  0.387755  three
2018-10-06 -0.725324  0.122176  0.289968  0.838419   four
2018-10-07 -0.469505  0.968887  1.162312  1.700180  three

In [52]:
df2[df2['E'].isin(['two', 'four'])] #利用E中选择对数据进行筛选

                   A         B         C         D     E
2018-10-04 -0.109833  0.415351  0.350937  0.068331   two
2018-10-06 -0.725324  0.122176  0.289968  0.838419  four

In [54]:
#赋值
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range('20181002', periods = 6))

In [55]:
s1

2018-10-02    1
2018-10-03    2
2018-10-04    3
2018-10-05    4
2018-10-06    5
2018-10-07    6
Freq: D, dtype: int64

In [56]:
df['F'] = s1

In [57]:
df

                   A         B         C         D  F
2018-10-02  1.064473 -1.567862  0.168697  0.535627  1
2018-10-03  0.299244 -0.718623  0.356511  1.885957  2
2018-10-04 -0.109833  0.415351  0.350937  0.068331  3
2018-10-05 -1.869260  0.441762 -1.020656  0.387755  4
2018-10-06 -0.725324  0.122176  0.289968  0.838419  5
2018-10-07 -0.469505  0.968887  1.162312  1.700180  6

In [58]:
df.at['20181002', 'A'] = 0

In [59]:
df

                   A         B         C         D  F
2018-10-02  0.000000 -1.567862  0.168697  0.535627  1
2018-10-03  0.299244 -0.718623  0.356511  1.885957  2
2018-10-04 -0.109833  0.415351  0.350937  0.068331  3
2018-10-05 -1.869260  0.441762 -1.020656  0.387755  4
2018-10-06 -0.725324  0.122176  0.289968  0.838419  5
2018-10-07 -0.469505  0.968887  1.162312  1.700180  6

In [60]:
df.iat[0,1] = 0

In [61]:
df

                   A         B         C         D  F
2018-10-02  0.000000  0.000000  0.168697  0.535627  1
2018-10-03  0.299244 -0.718623  0.356511  1.885957  2
2018-10-04 -0.109833  0.415351  0.350937  0.068331  3
2018-10-05 -1.869260  0.441762 -1.020656  0.387755  4
2018-10-06 -0.725324  0.122176  0.289968  0.838419  5
2018-10-07 -0.469505  0.968887  1.162312  1.700180  6

In [62]:
df.loc[:, 'D'] = np.array([5]*len(df))

In [63]:
df

                   A         B         C  D  F
2018-10-02  0.000000  0.000000  0.168697  5  1
2018-10-03  0.299244 -0.718623  0.356511  5  2
2018-10-04 -0.109833  0.415351  0.350937  5  3
2018-10-05 -1.869260  0.441762 -1.020656  5  4
2018-10-06 -0.725324  0.122176  0.289968  5  5
2018-10-07 -0.469505  0.968887  1.162312  5  6

In [64]:
df2 = df.copy()
df2[df2>0] = -df2

In [65]:
df2

                   A         B         C  D  F
2018-10-02  0.000000  0.000000 -0.168697 -5 -1
2018-10-03 -0.299244 -0.718623 -0.356511 -5 -2
2018-10-04 -0.109833 -0.415351 -0.350937 -5 -3
2018-10-05 -1.869260 -0.441762 -1.020656 -5 -4
2018-10-06 -0.725324 -0.122176 -0.289968 -5 -5
2018-10-07 -0.469505 -0.968887 -1.162312 -5 -6

# 缺失数据处理

In [78]:
df

                   A         B         C  D  F
2018-10-02  0.000000  0.000000  0.168697  5  1
2018-10-03  0.299244 -0.718623  0.356511  5  2
2018-10-04 -0.109833  0.415351  0.350937  5  3
2018-10-05 -1.869260  0.441762 -1.020656  5  4
2018-10-06 -0.725324  0.122176  0.289968  5  5
2018-10-07 -0.469505  0.968887  1.162312  5  6

In [80]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])

In [81]:
df1

                   A         B         C  D  F   E
2018-10-02  0.000000  0.000000  0.168697  5  1 NaN
2018-10-03  0.299244 -0.718623  0.356511  5  2 NaN
2018-10-04 -0.109833  0.415351  0.350937  5  3 NaN
2018-10-05 -1.869260  0.441762 -1.020656  5  4 NaN

In [87]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [90]:
df1.loc[dates[0], 'F'] = np.nan

In [91]:
df1

                   A         B         C  D    F    E
2018-10-02  0.000000  0.000000  0.168697  5  NaN  1.0
2018-10-03  0.299244 -0.718623  0.356511  5  2.0  1.0
2018-10-04 -0.109833  0.415351  0.350937  5  3.0  NaN
2018-10-05 -1.869260  0.441762 -1.020656  5  4.0  NaN

In [92]:
#丢弃任意拥有缺失数据的列
df1.dropna(how="any")

                   A         B         C  D    F    E
2018-10-03  0.299244 -0.718623  0.356511  5  2.0  1.0

In [93]:
#填充缺失数据
df1.fillna(value = 5)

                   A         B         C  D    F    E
2018-10-02  0.000000  0.000000  0.168697  5  5.0  1.0
2018-10-03  0.299244 -0.718623  0.356511  5  2.0  1.0
2018-10-04 -0.109833  0.415351  0.350937  5  3.0  5.0
2018-10-05 -1.869260  0.441762 -1.020656  5  4.0  5.0

In [94]:
#当获得布尔值掩模当数据为nan时
pd.isnull(df1)

                A      B      C      D      F      E
2018-10-02  False  False  False  False   True  False
2018-10-03  False  False  False  False  False  False
2018-10-04  False  False  False  False  False   True
2018-10-05  False  False  False  False  False   True

# 统计值

In [96]:
df.mean()

A   -0.479113
B    0.204925
C    0.217961
D    5.000000
F    3.500000
dtype: float64

In [99]:
df.mean(axis =1)

2018-10-02    1.233739
2018-10-03    1.387426
2018-10-04    1.731291
2018-10-05    1.310369
2018-10-06    1.937364
2018-10-07    2.532339
Freq: D, dtype: float64

In [106]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates)

In [107]:
s

2018-10-02    1.0
2018-10-03    3.0
2018-10-04    5.0
2018-10-05    NaN
2018-10-06    6.0
2018-10-07    8.0
Freq: D, dtype: float64

In [113]:
s=s.shift(2)
#shift函数是对数据进行移动的操作

In [115]:
s

2018-10-02    NaN
2018-10-03    NaN
2018-10-04    1.0
2018-10-05    3.0
2018-10-06    5.0
2018-10-07    NaN
Freq: D, dtype: float64

In [116]:
df

                   A         B         C  D  F
2018-10-02  0.000000  0.000000  0.168697  5  1
2018-10-03  0.299244 -0.718623  0.356511  5  2
2018-10-04 -0.109833  0.415351  0.350937  5  3
2018-10-05 -1.869260  0.441762 -1.020656  5  4
2018-10-06 -0.725324  0.122176  0.289968  5  5
2018-10-07 -0.469505  0.968887  1.162312  5  6

In [117]:
#对于拥有不同维度的对象，操作需要进行对齐。pandas会自动沿着选定的维度进行broadcasts
df.sub(s, axis = 'index')

                   A         B         C    D    F
2018-10-02       NaN       NaN       NaN  NaN  NaN
2018-10-03       NaN       NaN       NaN  NaN  NaN
2018-10-04 -1.109833 -0.584649 -0.649063  4.0  2.0
2018-10-05 -4.869260 -2.558238 -4.020656  2.0  1.0
2018-10-06 -5.725324 -4.877824 -4.710032  0.0  0.0
2018-10-07       NaN       NaN       NaN  NaN  NaN

In [118]:
#对数据应用函数
df

                   A         B         C  D  F
2018-10-02  0.000000  0.000000  0.168697  5  1
2018-10-03  0.299244 -0.718623  0.356511  5  2
2018-10-04 -0.109833  0.415351  0.350937  5  3
2018-10-05 -1.869260  0.441762 -1.020656  5  4
2018-10-06 -0.725324  0.122176  0.289968  5  5
2018-10-07 -0.469505  0.968887  1.162312  5  6

In [119]:
#对每列进行累计的值之和
df.apply(np.cumsum)

                   A         B         C   D   F
2018-10-02  0.000000  0.000000  0.168697   5   1
2018-10-03  0.299244 -0.718623  0.525208  10   3
2018-10-04  0.189411 -0.303272  0.876145  15   6
2018-10-05 -1.679849  0.138490 -0.144511  20  10
2018-10-06 -2.405174  0.260666  0.145457  25  15
2018-10-07 -2.874678  1.229552  1.307769  30  21

In [122]:
#直方图
s = pd.Series(np.random.randint(0, 7, size=10))

In [123]:
s

0    3
1    0
2    1
3    3
4    6
5    1
6    5
7    3
8    3
9    2
dtype: int32

In [124]:
s.value_counts()

3    4
1    2
6    1
5    1
2    1
0    1
dtype: int64

In [125]:
#字符串方法

s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [126]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 合并

In [127]:
df = pd.DataFrame(np.random.randn(10, 4))

In [128]:
df

          0         1         2         3
0  1.126008 -0.167902  1.191394 -2.802212
1 -0.351854  0.230495 -0.079249  0.971530
2  0.003642 -0.054661 -0.884319  0.225822
3 -0.360948  0.517246  1.629620  0.571706
4  0.090689  0.425017  0.044071  1.539898
5  1.539139 -1.986067  0.407123 -0.389599
6 -0.252298  0.142137 -0.217095  2.157145
7 -1.276547 -2.040935 -1.307999 -0.250039
8 -0.670876 -0.360220  1.864360  1.667419
9 -0.313112  0.247557  0.083479  0.394162

In [129]:
pieces = [df[:3], df[3:7], df[7:]]

In [130]:
pieces

[          0         1         2         3
 0  1.126008 -0.167902  1.191394 -2.802212
 1 -0.351854  0.230495 -0.079249  0.971530
 2  0.003642 -0.054661 -0.884319  0.225822,
           0         1         2         3
 3 -0.360948  0.517246  1.629620  0.571706
 4  0.090689  0.425017  0.044071  1.539898
 5  1.539139 -1.986067  0.407123 -0.389599
 6 -0.252298  0.142137 -0.217095  2.157145,
           0         1         2         3
 7 -1.276547 -2.040935 -1.307999 -0.250039
 8 -0.670876 -0.360220  1.864360  1.667419
 9 -0.313112  0.247557  0.083479  0.394162]

In [131]:
pd.concat(pieces)

          0         1         2         3
0  1.126008 -0.167902  1.191394 -2.802212
1 -0.351854  0.230495 -0.079249  0.971530
2  0.003642 -0.054661 -0.884319  0.225822
3 -0.360948  0.517246  1.629620  0.571706
4  0.090689  0.425017  0.044071  1.539898
5  1.539139 -1.986067  0.407123 -0.389599
6 -0.252298  0.142137 -0.217095  2.157145
7 -1.276547 -2.040935 -1.307999 -0.250039
8 -0.670876 -0.360220  1.864360  1.667419
9 -0.313112  0.247557  0.083479  0.394162

In [133]:
#加入
left = pd.DataFrame({'key':['foo', 'foo'], 'lval' :[1, 2]})
right = pd.DataFrame({'key':['foo', 'foo'], 'rval':[4, 5]})

In [134]:
left

   key  lval
0  foo     1
1  foo     2

In [135]:
right

   key  rval
0  foo     4
1  foo     5

In [136]:
#用于SQL式的合并
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [137]:
#添加
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [139]:
df

          A         B         C         D
0  0.620113 -0.002640  1.396517 -0.249021
1 -0.454825  0.936109  1.561788 -1.454899
2  1.938706  0.438507  1.387645  0.476202
3  2.315011  0.492560 -0.234434  0.257536
4 -0.983532 -0.369762 -0.485063 -0.780690
5  0.904508 -0.355370 -0.380039  0.080245
6  0.113714  0.555105 -0.752846  0.314952
7  0.418053 -0.645469  0.875132 -0.093665

In [140]:
s = df.iloc[3]

In [141]:
s

A    2.315011
B    0.492560
C   -0.234434
D    0.257536
Name: 3, dtype: float64

In [142]:
df.append(s, ignore_index = True)

          A         B         C         D
0  0.620113 -0.002640  1.396517 -0.249021
1 -0.454825  0.936109  1.561788 -1.454899
2  1.938706  0.438507  1.387645  0.476202
3  2.315011  0.492560 -0.234434  0.257536
4 -0.983532 -0.369762 -0.485063 -0.780690
5  0.904508 -0.355370 -0.380039  0.080245
6  0.113714  0.555105 -0.752846  0.314952
7  0.418053 -0.645469  0.875132 -0.093665
8  2.315011  0.492560 -0.234434  0.257536

# 分组

In [145]:
df = pd.DataFrame({'A' :['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo' ], 
                                 'B' :['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                                 'C' :np.random.randn(8),
                                 'D': np.random.randn(8) })

In [146]:
df

     A      B         C         D
0  foo    one  0.524195  1.432958
1  bar    one -0.627545  0.452618
2  foo    two  1.237118  0.537579
3  bar  three  0.226037  0.237896
4  foo    two  0.961887 -0.674327
5  bar    two  2.386111 -1.159071
6  foo    one  1.263846 -0.576641
7  foo  three  1.386735  3.109951

In [147]:
df.groupby('A').sum()

            C         D
A
bar  1.984603 -0.468557
foo  5.373781  3.829519

In [148]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.627545  0.452618
    three  0.226037  0.237896
    two    2.386111 -1.159071
foo one    1.788041  0.856316
    three  1.386735  3.109951
    two    2.199006 -0.136748

In [149]:
#变形
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                             ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))

In [150]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

# Stack

In [152]:
index = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])

In [153]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [157]:
df

                     A         B
first second
bar   one     0.459195  0.407686
      two    -0.267147  0.550231
baz   one     1.623285 -1.211021
      two     1.061921  1.026922
foo   one    -0.689867 -1.027913
      two     1.687028 -2.284310
qux   one    -0.111735  1.643306
      two     0.346304  0.546471

In [154]:
df = pd.DataFrame(np.random.randn(8, 2), index = index, columns=['A', 'B'])

In [155]:
df

                     A         B
first second
bar   one     0.459195  0.407686
      two    -0.267147  0.550231
baz   one     1.623285 -1.211021
      two     1.061921  1.026922
foo   one    -0.689867 -1.027913
      two     1.687028 -2.284310
qux   one    -0.111735  1.643306
      two     0.346304  0.546471

In [158]:
df2 = df[:4]

In [159]:
df2

                     A         B
first second
bar   one     0.459195  0.407686
      two    -0.267147  0.550231
baz   one     1.623285 -1.211021
      two     1.061921  1.026922

In [160]:
stacked = df2.stack()

In [163]:
df2.stack()

first  second
bar    one     A    0.459195
               B    0.407686
       two     A   -0.267147
               B    0.550231
baz    one     A    1.623285
               B   -1.211021
       two     A    1.061921
               B    1.026922
dtype: float64

In [164]:
stacked.unstack()

                     A         B
first second
bar   one     0.459195  0.407686
      two    -0.267147  0.550231
baz   one     1.623285 -1.211021
      two     1.061921  1.026922

# 数据透视表

In [165]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                                 'B' : ['A', 'B', 'C'] * 4,
                                 'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                                 'D' : np.random.randn(12),
                                 'E' : np.random.randn(12)})

In [166]:
df

        A  B    C         D         E
0     one  A  foo  0.293933  1.045122
1     one  B  foo -1.304268 -0.212998
2     two  C  foo  1.295419  0.389755
3   three  A  bar -0.657734  0.549030
4     one  B  bar -1.159943 -0.238367
5     one  C  bar  0.934928  0.021321
6     two  A  foo  1.296965  0.504656
7   three  B  foo -2.081984 -0.012336
8     one  C  foo -1.128801  0.634904
9     one  A  bar  0.916886 -1.433138
10    two  B  bar -0.293407 -0.518036
11  three  C  bar  0.797471  0.710216

In [167]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.916886  0.293933
      B -1.159943 -1.304268
      C  0.934928 -1.128801
three A -0.657734       NaN
      B       NaN -2.081984
      C  0.797471       NaN
two   A       NaN  1.296965
      B -0.293407       NaN
      C       NaN  1.295419

# 时间序列

In [168]:
rng = pd.date_range('1/1/2018', periods=100, freq = 'S')

In [169]:
rng

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 00:00:01',
               '2018-01-01 00:00:02', '2018-01-01 00:00:03',
               '2018-01-01 00:00:04', '2018-01-01 00:00:05',
               '2018-01-01 00:00:06', '2018-01-01 00:00:07',
               '2018-01-01 00:00:08', '2018-01-01 00:00:09',
               '2018-01-01 00:00:10', '2018-01-01 00:00:11',
               '2018-01-01 00:00:12', '2018-01-01 00:00:13',
               '2018-01-01 00:00:14', '2018-01-01 00:00:15',
               '2018-01-01 00:00:16', '2018-01-01 00:00:17',
               '2018-01-01 00:00:18', '2018-01-01 00:00:19',
               '2018-01-01 00:00:20', '2018-01-01 00:00:21',
               '2018-01-01 00:00:22', '2018-01-01 00:00:23',
               '2018-01-01 00:00:24', '2018-01-01 00:00:25',
               '2018-01-01 00:00:26', '2018-01-01 00:00:27',
               '2018-01-01 00:00:28', '2018-01-01 00:00:29',
               '2018-01-01 00:00:30', '2018-01-01 00:00:31',
               '2018-01-01 00:00:32', '2018-01-01 00:00:33',
               '2018-01-01 00:00:34', '2018-01-01 00:00:35',
               '2018-01-01 00:00:36', '2018-01-01 00:00:37',
               '2018-01-01 00:00:38', '2018-01-01 00:00:39',
               '2018-01-01 00:00:40', '2018-01-01 00:00:41',
               '2018-01-01 00:00:42', '2018-01-01 00:00:43',
               '2018-01-01 00:00:44', '2018-01-01 00:00:45',
               '2018-01-01 00:00:46', '2018-01-01 00:00:47',
               '2018-01-01 00:00:48', '2018-01-01 00:00:49',
               '2018-01-01 00:00:50', '2018-01-01 00:00:51',
               '2018-01-01 00:00:52', '2018-01-01 00:00:53',
               '2018-01-01 00:00:54', '2018-01-01 00:00:55',
               '2018-01-01 00:00:56', '2018-01-01 00:00:57',
               '2018-01-01 00:00:58', '2018-01-01 00:00:59',
               '2018-01-01 00:01:00', '2018-01-01 00:01:01',
               '2018-01-01 00:01:02', '2018-01-01 00:01:03',
               '2018-01-01 00:01:04', '2018-01-01 00:01:05',
               '2018-01-01 00:01:06', '2018-01-01 00:01:07',
               '2018-01-01 00:01:08', '2018-01-01 00:01:09',
               '2018-01-01 00:01:10', '2018-01-01 00:01:11',
               '2018-01-01 00:01:12', '2018-01-01 00:01:13',
               '2018-01-01 00:01:14', '2018-01-01 00:01:15',
               '2018-01-01 00:01:16', '2018-01-01 00:01:17',
               '2018-01-01 00:01:18', '2018-01-01 00:01:19',
               '2018-01-01 00:01:20', '2018-01-01 00:01:21',
               '2018-01-01 00:01:22', '2018-01-01 00:01:23',
               '2018-01-01 00:01:24', '2018-01-01 00:01:25',
               '2018-01-01 00:01:26', '2018-01-01 00:01:27',
               '2018-01-01 00:01:28', '2018-01-01 00:01:29',
               '2018-01-01 00:01:30', '2018-01-01 00:01:31',
               '2018-01-01 00:01:32', '2018-01-01 00:01:33',
               '2018-01-01 00:01:34', '2018-01-01 00:01:35',
               '2018-01-01 00:01:36', '2018-01-01 00:01:37',
               '2018-01-01 00:01:38', '2018-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [170]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index = rng)

In [171]:
ts

2018-01-01 00:00:00     90
2018-01-01 00:00:01     90
2018-01-01 00:00:02    339
2018-01-01 00:00:03    386
2018-01-01 00:00:04    287
2018-01-01 00:00:05    136
2018-01-01 00:00:06    391
2018-01-01 00:00:07    334
2018-01-01 00:00:08    385
2018-01-01 00:00:09    120
2018-01-01 00:00:10    385
2018-01-01 00:00:11    180
2018-01-01 00:00:12    105
2018-01-01 00:00:13    289
2018-01-01 00:00:14    330
2018-01-01 00:00:15    338
2018-01-01 00:00:16    117
2018-01-01 00:00:17    125
2018-01-01 00:00:18    257
2018-01-01 00:00:19     24
2018-01-01 00:00:20    275
2018-01-01 00:00:21    218
2018-01-01 00:00:22     12
2018-01-01 00:00:23    200
2018-01-01 00:00:24    425
2018-01-01 00:00:25    211
2018-01-01 00:00:26    125
2018-01-01 00:00:27    461
2018-01-01 00:00:28    400
2018-01-01 00:00:29    346
                      ...
2018-01-01 00:01:10     29
2018-01-01 00:01:11    107
2018-01-01 00:01:12    477
2018-01-01 00:01:13    138
2018-01-01 00:01:14     51
2018-01-01 00:01:15     54
2018-01-01 00:01:16    329
2018-01-01 00:01:17    428
2018-01-01 00:01:18    482
2018-01-01 00:01:19    189
2018-01-01 00:01:20    101
2018-01-01 00:01:21    293
2018-01-01 00:01:22    212
2018-01-01 00:01:23    313
2018-01-01 00:01:24    325
2018-01-01 00:01:25    421
2018-01-01 00:01:26    323
2018-01-01 00:01:27    160
2018-01-01 00:01:28    448
2018-01-01 00:01:29    489
2018-01-01 00:01:30    259
2018-01-01 00:01:31    227
2018-01-01 00:01:32    343
2018-01-01 00:01:33     48
2018-01-01 00:01:34    192
2018-01-01 00:01:35    172
2018-01-01 00:01:36    168
2018-01-01 00:01:37    175
2018-01-01 00:01:38     50
2018-01-01 00:01:39    421
Freq: S, Length: 100, dtype: int32

In [179]:
#采样频率为五分钟, 高频数据到低频数据
ts.resample("1Min").sum()

2018-01-01 00:00:00    16096
2018-01-01 00:01:00     9753
Freq: T, dtype: int32

In [180]:
# 时区转换
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06   -0.370995
2012-03-07   -0.081769
2012-03-08   -0.268603
2012-03-09    0.700946
2012-03-10   -0.150584
Freq: D, dtype: float64

In [182]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00   -0.370995
2012-03-07 00:00:00+00:00   -0.081769
2012-03-08 00:00:00+00:00   -0.268603
2012-03-09 00:00:00+00:00    0.700946
2012-03-10 00:00:00+00:00   -0.150584
Freq: D, dtype: float64

In [183]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.370995
2012-03-06 19:00:00-05:00   -0.081769
2012-03-07 19:00:00-05:00   -0.268603
2012-03-08 19:00:00-05:00    0.700946
2012-03-09 19:00:00-05:00   -0.150584
Freq: D, dtype: float64

In [184]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -1.295792
2012-02-29   -0.335724
2012-03-31   -0.311337
2012-04-30    0.409295
2012-05-31   -0.903735
Freq: M, dtype: float64

In [185]:
ps = ts.to_period()
ps

2012-01   -1.295792
2012-02   -0.335724
2012-03   -0.311337
2012-04    0.409295
2012-05   -0.903735
Freq: M, dtype: float64

In [186]:
ps.to_timestamp()

2012-01-01   -1.295792
2012-02-01   -0.335724
2012-03-01   -0.311337
2012-04-01    0.409295
2012-05-01   -0.903735
Freq: MS, dtype: float64

# 分类

In [187]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [188]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [189]:
#将列的类型转化为category表示等经济
df["grade"] = df["raw_grade"].astype("category")

In [190]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [191]:
##改变类别标签，按顺序对应进行
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [192]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [193]:
#以类别排序
df.sort_values(by="grade")

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [196]:
# 进行分组
df.groupby("grade").size()

grade
very good    3
good         2
very bad     1
dtype: int64

## 保存csv

In [197]:
df.to_csv('foo.csv')

In [198]:
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

In [199]:
df.to_hdf('foo.h5','df')

ImportError: HDFStore requires PyTables, "No module named 'tables'" problem importing

In [200]:
pd.read_hdf('foo.h5','df')

FileNotFoundError: File foo.h5 does not exist

In [201]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

ImportError: No module named 'openpyxl'

In [202]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

ImportError: Install xlrd >= 0.9.0 for Excel support